---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.AnalyticalPanel
source: html/52825e43-5e98-d848-b6dc-32cce704c4fa.htm
---
# AnalyticalPanel Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.